# St7SetGeometryFaceHeatSource1

Assigns a heat source to the specified geometry face.

long St7SetGeometryFaceHeatSource1(long uID, long FaceNum, long CaseNum,
double* Doubles)
Input Parameters
uID
Strand7 model file ID.
FaceNum
Face number.
CaseNum
Load case number.
Doubles[0]
Heat source.